paypal-connector-test/src/test/resources/artifacts/ESB/config/soapRequests/paypal/grantTokenFromAuthorization.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.paypal.granttokenfromauthorization">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:paypalApiUrl>https://api.sandbox.paypal.com</urn:paypalApiUrl>
      <urn:authorization>Bearer L8XmqR.Jp3ziVtzRTY0WEUfMpsE5Xw1qor2fGv51r.E</urn:authorization>
      <urn:grantType>code</urn:grantType>
      <urn:authorizationCode>wqdI69Yfsu3ShU2IShvd2d</urn:authorizationCode>
      <urn:redirecturl>http://www.virtusa.com/</urn:redirecturl>
   </soapenv:Body>
</soapenv:Envelope>
